#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
module.vm[0].data.modtm_module_source.telemetry[0]: Reading...
module.nsg[0].data.modtm_module_source.telemetry[0]: Reading...
module.vnet[0].data.modtm_module_source.telemetry[0]: Reading...
module.resource_group[0].data.modtm_module_source.telemetry[0]: Reading...
module.vnet[0].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group[0].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.vm[0].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.nsg[0].data.modtm_module_source.telemetry[0]: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.nsg[0].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.resource_group[0].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.vm[0].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.vm[0].tls_private_key.this[0] will be created
  + resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.vnet[0].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + deployment_info = {
      + networks         = {
          + vnet-demo = "vnet-free-demo"
        }
      + resource_groups  = {
          + rg-demo = "rg-free-demo"
        }
      + security_groups  = {
          + nsg-web = "nsg-web"
        }
      + virtual_machines = [
          + "vm-web",
        ]
    }
  + vm_network_info = "Check Azure portal for IP addresses"

Warning: Value for undeclared variable

The root module does not declare a variable named "resource_group" but a
value was found in file
"/home/opc/actions-runner/_work/clickops-orchestrator-azure/clickops-orchestrator-azure/azure/fra/iam.json".
If you meant to use this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "network" but a value was
found in file
"/home/opc/actions-runner/_work/clickops-orchestrator-azure/clickops-orchestrator-azure/azure/fra/network.json".
If you meant to use this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 1 other variable(s) defined
without being declared.

```

</details>

*Pushed by: @iblake, Action: `pull_request`*